In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({"A": [3, 6, 1, 12, 3], "B": [0, 0, 7, 5, 6], "C": [10, 4, 5, 8, 2]})
df

    A  B   C
0   3  0  10
1   6  0   4
2   1  7   5
3  12  5   8
4   3  6   2

In [5]:
df.sort_index(ascending=False)

    A  B   C
4   3  6   2
3  12  5   8
2   1  7   5
1   6  0   4
0   3  0  10

In [7]:
df.sort_index(ascending=False, axis=1)

    C  B   A
0  10  0   3
1   4  0   6
2   5  7   1
3   8  5  12
4   2  6   3

In [8]:
df["A"].sort_values()

2     1
0     3
4     3
1     6
3    12
Name: A, dtype: int64

In [9]:
#apply sort to entire DF
df.sort_values("A")

    A  B   C
2   1  7   5
0   3  0  10
4   3  6   2
1   6  0   4
3  12  5   8

In [10]:
#apply sorting logic if same value
df.sort_values(["A", "C"])

    A  B   C
2   1  7   5
4   3  6   2
0   3  0  10
1   6  0   4
3  12  5   8